{
  "largeText": "LEGAL NOTICE\n\nRe: Intended Action No. 32 / 2025 - HCA 533 / 2025 (the \"Proceedings\")\n\nChen Shanxuan (陈善轩) (the 1st Defendant)\nThe Programmer Wallet: 0xc49b5e5B9DA66B9126c1a62e9761E6b2147DE3E1 (the 2nd Defendant)\nThe First Layer Wallet: 0x3ac96134Fb0e42a52D33045AeE50b89790f05Ed0 (the 3rd Defendant)\nThe Second Layer Wallet: 0xfcC8Ad911976d752890f2140D9F4edd2c64a6e49 (the 4th Defendant)\n\nWARNING\n\nThis is a message from BP SG Investment Holding Limited, the Plaintiff in the captioned Proceedings.\n\nThe specific crypto assets held in the Programmer Wallet, the First Layer Wallet and/or the Second Layer Wallet, including but not limited to the assets traced from the Plaintiff's funds amounting to 49,516,662.977 USDC, are subject to an ongoing legal dispute and are contentious in nature.\n\nAny subsequent holders of the said crypto assets (if any) once held in those wallets that they cannot claim the status of bona fide purchases without notice of the dispute.\n\nPlease access here for copies of documents issued by the Hong Kong Court: (a) a sealed injunction order granted by the Honourable Mr. Justice Lok on 17 March 2025, which contains inter alia an injunction order against the Defendants (the \"Injunction Order\"); and (b) a sealed copy of the Concurrent Writ of Summons issued on 20 March 2025.\n\nThe other important documents can be found here:\n\nLink:https://howsewilliams-my.sharepoint.com/personal/regulatory_howsewilliams_com/_layouts/15/onedrive.aspx?id=%2Fpersonal%2Fregulatory%5Fhowsewilliams%5Fcom%2FDocuments%2FInfini%20Labs%5FBP%20SG%2FD1%2C%20D2%2C%20D3%2C%20D4%5FHCA%20533%20of%202025%20%28Intended%20Action%20no%2032%20of%202025%29&ga=1\nPassword: D1234@5##\n\nThe Injunction Order is returnable before Lok J on Thursday, 27 March 2025 at 9:30 am (HK Time) (30 minutes reserved) (\"Return Date Hearing\").\n\nThe Defendants are required to attend the Return Date Hearing, failing which an order may be made in any of the defendants' absence.",
  "fileUrl": "https://howsewilliams-my.sharepoint.com/personal/regulatory_howsewilliams_com/_layouts/15/onedrive.aspx?id=%2Fpersonal%2Fregulatory%5Fhowsewilliams%5Fcom%2FDocuments%2FInfini%20Labs%5FBP%20SG%2FD1%2C%20D2%2C%20D3%2C%20D4%5FHCA%20533%20of%202025%20%28Intended%20Action%20no%2032%20of%202025%29&ga=1",
  "pdfPath": "./documents/document.pdf"
}
